org/onlisp.org
#+STARTUP: showall indent hidestars
#+HTML_HEAD: <!-- -*- mode: org; fill-column: 87 -*-  -->

#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="css/style.css" rel="stylesheet" type="text/css" />

#+OPTIONS: toc:nil num:nil h:4 html-postamble:nil html-preamble:t tex:t f:t

#+TOC: headlines 3

#+HTML: <div class="outline-2" id="meta"><a href="index.html">На главную</a></div>

#+TITLE: Перевод OnLisp Пола Грэма

* О проекте перевода

Это проект по переводу книги OnLisp Пола Грэма. Переводим на гитхабе:
https://github.com/rigidus/onlisp

Перевод полностью открытый, мы приглашаем переводчиков и
редакторов. Также приглашаются все, кто желает заняться вычиткой.

* Переведенные главы:

- 01 - The Extensible Language
- 02 - Functions
- 03 - Functional Programming
- 06 - Functions as Representation
- 22 - Nondeterminism

* Текущие переводимые главы

- Главу 16 - Macro-Defining Macros и 17 - Read-Macros переводит Andrew Kondratovich
- Главы с 7 по 10 переводит Zeldan (https://github.com/Zeldan)
- Главу 25 переводит orivej (https://github.com/orivej)
- Главу 5 переводит irmpow (https://github.com/irmpow)
