www/prj/onlisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Перевод OnLisp Пола Грэма</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Перевод OnLisp Пола Грэма</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org37e1bc2">О проекте перевода</a></li>
<li><a href="#org121accd">Переведенные главы:</a></li>
<li><a href="#orge425a49">Текущие переводимые главы</a></li>
</ul>
</div>
</div>

<div id="outline-container-org37e1bc2" class="outline-2">
<h2 id="org37e1bc2">О проекте перевода</h2>
<div class="outline-text-2" id="text-org37e1bc2">
<p>
Это проект по переводу книги OnLisp Пола Грэма. Переводим на гитхабе:
<a href="https://github.com/rigidus/onlisp">https://github.com/rigidus/onlisp</a>
</p>

<p>
Перевод полностью открытый, мы приглашаем переводчиков и
редакторов. Также приглашаются все, кто желает заняться вычиткой.
</p>
</div>
</div>

<div id="outline-container-org121accd" class="outline-2">
<h2 id="org121accd">Переведенные главы:</h2>
<div class="outline-text-2" id="text-org121accd">
<ul class="org-ul">
<li>01 - The Extensible Language</li>
<li>02 - Functions</li>
<li>03 - Functional Programming</li>
<li>06 - Functions as Representation</li>
<li>22 - Nondeterminism</li>
</ul>
</div>
</div>

<div id="outline-container-orge425a49" class="outline-2">
<h2 id="orge425a49">Текущие переводимые главы</h2>
<div class="outline-text-2" id="text-orge425a49">
<ul class="org-ul">
<li>Главу 16 - Macro-Defining Macros и 17 - Read-Macros переводит Andrew Kondratovich</li>
<li>Главы с 7 по 10 переводит Zeldan (<a href="https://github.com/Zeldan">https://github.com/Zeldan</a>)</li>
<li>Главу 25 переводит orivej (<a href="https://github.com/orivej">https://github.com/orivej</a>)</li>
<li>Главу 5 переводит irmpow (<a href="https://github.com/irmpow">https://github.com/irmpow</a>)</li>
</ul>
</div>
</div>
</div>
</body>
</html>
